# StepInto Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIMacroManager..::..StepInto Method
UIMacroManager Class See Also
---
Step into the macro in sharp develop.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void StepInto(
	Macro macro
)
```

Visual Basic
---
```text
Public Sub StepInto ( _
	macro As Macro _
)
```

Visual C++
---
```text
public:
void StepInto(
	Macro^ macro
)
```

# ### Parameters
macro
    Type: Autodesk.Revit.DB.Macros..::..Macro The macro.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Throw when the module is unloaded, or it is a Ruby or Python script. |

# See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace